# ExchangeEntityId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ExchangeEntityId Property
ParameterTypeId Class See Also
---
"Exchange Entity ID"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ExchangeEntityId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExchangeEntityId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ExchangeEntityId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace